Repository: SanushRadalage/AgroPal
Catalog: assets/l10n/app_*.arb
Languages: si

# localeTitle
source: Hello! Please Select Your Language
si: ආයුබෝවන්! කරුණාකර ඔබගේ භාෂාව තෝරන්න

source: Next
si: ඊළඟ

# loginTitle
source: Please enter your mobile number
si: කරුණාකර ඔබගේ ජංගම දුරකථන අංකය ඇතුලත් කරන්න

source: Mobile Number
si: ජංගම දුරකථන අංකය

source: invalid mobile number
si: වලංගු නොවන ජංගම දුරකථන අංකයකි

# otpTitle
source: Please enter the otp
si: කරුණාකර OTP අංකය ඇතුලත් කරන්න

source: Done
si: ඉදිරිපත් කරන්න

source: Farmer
si: ගොවි

source: Landowner
si: ඉඩම් හිමි

source: First Name
si: මුල් නම

source: Last Name
si: අවසන් නම

# nic
source: NIC/Passport
si: ජාහැඅ/විගබඅ

# validationFName
source: Enter a valid first name
si: වලංගු මුල් නමක් ඇතුළත් කරන්න

# validationLName
source: Enter a valid last name
si: වලංගු අවසාන නමක් ඇතුළත් කරන්න

# validationNIC
source: Enter a valid NIC
si: වලංගු හැඳුනුම්පතක් හෝ විදේශ ගමන් බලපත්‍ර අංකයක් ඇතුළත් කරන්න

# commonErrorMsg
source: Oops! Something went wrong.
si: නැවත උත්සහා කරන්න!
